src/cf/InformationRegisters/вогНапоминанияОСообщениях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогНапоминанияОСообщениях</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаголовокОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_Напоминания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_Напоминания</Name>
			<Comment>Данный регистр предназначен для реализации механизма напоминаний. Напоминание - сообщение которое может быть выведено на экран любому пользователю конфигурации единожды либо с заданной регулярностью.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Дата до которой напоминание считается актуальным. Не актуальные напоминания удаляются.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание напоминания - сообщение содержащее суть напоминания.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Comment>Содержит число, показывающее, сколько раз напоминание было отложено</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СрокОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПериодичностьОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Получатель  напоминания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Comment>Ссылка на объект конфигурации прилагаемый к напоминанию</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата напоминания (для нового равно дате оповещения)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОповещения</Name>
					<Comment>Дата напоминания +  отсрочка (срок на который пользователь отложил напоминание)  </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/вогСистемаВзаимодействийСервер/Ext/Module.bsl
//Функция находит первое контекстное обсуждение по переданному объекту
//Параметры:
//	СсылкаНаОбъект - ЛюбаяСсылка
//Возвращает:
//	Тип: ИдентификаторОбсужденияСистемыВзаимодействия или Неопределено, если не найдено обсуждение
Функция ПолучитьОбсуждениеПоОбъекту(СсылкаНаОбъект) Экспорт
	
	URL = ПолучитьНавигационнуюСсылку(СсылкаНаОбъект);
	ОтборОбсуждения = Новый ОтборОбсужденийСистемыВзаимодействия;
	ОтборОбсуждения.КонтекстОбсуждения = Новый КонтекстОбсужденияСистемыВзаимодействия(URL);
	ОтборОбсуждения.КонтекстноеОбсуждение = Истина;
	СписокОбсуждений = СистемаВзаимодействия.ПолучитьОбсуждения(ОтборОбсуждения);
	Если СписокОбсуждений.Количество() > 0 тогда
		Возврат СписокОбсуждений[0].Идентификатор;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

//Функция создаёт новое контекстное обсуждение для объекта
//Сначала происходит поиск уже существующего обсуждения и возвращается его идентификатор, если найдено
//Параметры:
// СсылкаНаОбъект - любая ссылка
//Возвращает:
// Тип: ИдентификаторОбсужденияСистемыВзаимодействия или Неопределено, если не найдено обсуждение
Функция СоздатьНовоеОбсуждениеПоОбъекту(СсылкаНаОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = ПолучитьОбсуждениеПоОбъекту(СсылкаНаОбъект);
	Если Результат = Неопределено тогда
		URL = ПолучитьНавигационнуюСсылку(СсылкаНаОбъект);
		НовоеОбсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
		НовоеОбсуждение.КонтекстОбсуждения = Новый КонтекстОбсужденияСистемыВзаимодействия(URL);
		НовоеОбсуждение.Отображаемое = Истина;
		НовоеОбсуждение.Заголовок = ""+СсылкаНаОбъект;
		НовоеОбсуждение.Записать();
		Результат = НовоеОбсуждение.Идентификатор;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Процедура добавляет в регистр сведений вогНапоминанияОСообщениях записи
Процедура ДобавитьНапоминаниеДляПолучателейПриОтправкеСообщения(Получатели,Контекст,ЗаголовокОбсуждения,ТекстСообщения) экспорт
	
	Для каждого Получатель из Получатели цикл
		МЗ = РегистрыСведений.вогНапоминанияОСообщениях.СоздатьМенеджерЗаписи();
		МЗ.Контекст = Контекст;       
		МЗ.Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",СистемаВзаимодействия.ПолучитьИдентификаторПользователяИнформационнойБазы(Получатель));
		МЗ.ДатаСообщения = ТекущаяДата();
		МЗ.ЗаголовокОбсуждения = ЗаголовокОбсуждения;
		МЗ.ТекстСообщения = ТекстСообщения;
		МЗ.Записать();
		
		МЗ = РегистрыСведений.CRM_Напоминания.СоздатьМенеджерЗаписи();
		МЗ.Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",СистемаВзаимодействия.ПолучитьИдентификаторПользователяИнформационнойБазы(Получатель));
		МЗ.Предмет = Контекст;
		МЗ.ДатаНачала = ТекущаяДата();
		МЗ.ДатаОповещения =МЗ.ДатаНачала;
		МЗ.ДатаАктуальности = МЗ.ДатаНачала + 3*24*3600;
		МЗ.Содержание = ЗаголовокОбсуждения + Символы.ПС + Символы.ВК + ТекстСообщения;
		МЗ.Важность = 2;
		МЗ.Счетчик = 0;
		МЗ.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

//Обработчик события получения формы, при открытии формы считаем что будет открыто обсуждение и все сообщения будут прочитаны
Процедура вогОткрытиеФормыОбъектаДляНапоминанийОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если ВидФормы="ФормаОбъекта" и Параметры.Свойство("Ключ") тогда
		Контекст = ПолучитьНавигационнуюСсылку(Параметры.ключ);
		Набор = РегистрыСведений.вогНапоминанияОСообщениях.СоздатьНаборЗаписей();
		Набор.Отбор.Контекст.Установить(Контекст); 
		Набор.Отбор.Пользователь.Установить(Пользователи.ТекущийПользователь());
		Набор.Прочитать();
		Для каждого Запись из Набор цикл
			Запись.Прочитано = Истина;
		КонецЦикла;
		Набор.Записать();
	КонецЕсли;
	
	
КонецПроцедуры

//Обработчик события закрытия формы,считаем что будет открыто обсуждение и все сообщения будут прочитаны
//Необходимо добавлять вызов в обработки ПриЗакрытии
Процедура ПриЗакрытииФормыОбъектa(URL) Экспорт
	
		Набор = РегистрыСведений.вогНапоминанияОСообщениях.СоздатьНаборЗаписей();
		Набор.Отбор.Контекст.Установить(URL); 
		Набор.Отбор.Пользователь.Установить(Пользователи.ТекущийПользователь());
		Набор.Прочитать();
		Для каждого Запись из Набор цикл
			Запись.Прочитано = Истина;
		КонецЦикла;
		Набор.Записать();
		
КонецПроцедуры
